spec/dummy/app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
  def index
    authorize skip_scoping: true
    @cities = apply_authz_scopes on: City.all

INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Melbourne"], ["created_at", "2018-11-29 01:20:37.478657"], ["updated_at", "2018-11-29 01:20:37.478657"]]
---
  def create

    @city = City.new(city_params)
    authorize using: @city

    if @city.save