spec/dummy/app/controllers/clearances_controller.rb

  def index
    authorize
    @clearances = Clearance.all
---
SELECT "clearances".* FROM "clearances"

  def create
    authorize
    @clearance = Clearance.new(clearance_params)

    if @clearance.save
---
INSERT INTO "clearances" ("level", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["level", 1], ["name", "Secret"], ["created_at", "2018-11-29 01:20:17.395269"], ["updated_at", "2018-11-29 01:20:17.395269"]]