spec/dummy/app/controllers/reports_controller.rb

SELECT "reports".* FROM "reports"
---
  def index
    @reports = Report.all

INSERT INTO "reports" ("user_id", "clearance_id", "city_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @report = Report.new(report_params)
    @report.user = current_user

    if @report.save

SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_report
      @report = Report.find(params[:id])